Tekla Open API Reference for Tekla Structures 2025
ControlPlane Properties
The ControlPlane type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the object.
 (Inherited from Object.)
IsMagnetic
 Determines whether the plane is magnetic or not.
IsUpToDate
Gets if the object does not have a modification which is not shared.
 (Inherited from ModelObject.)
ModificationTime
Gets latest time of the object was modified or created.
 (Inherited from ModelObject.)
Name
 The name of the control plane.
Plane
 The plane defining the position of the control plane.
Top
See Also
Reference
ControlPlane Class
Tekla.Structures.Model Namespace